{
  "nodes": [
    {
      "op": "null", 
      "name": "image", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "question", 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput0", 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    38, 
    40, 
    41, 
    44, 
    45, 
    48, 
    49, 
    51
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61
  ], 
  "heads": [[52, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10000]}
}