{
  "nodes": [
    {
      "op": "null", 
      "name": "image", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation28", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation29", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation30", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution15_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "6144"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm15", 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation31", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attrs": {"shape": "(0, 24, 25)"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose2", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "coord_tensor", 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims8", 
      "attrs": {"axis": "1"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat8", 
      "attrs": {
        "axis": "1", 
        "repeats": "25"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims9", 
      "attrs": {"axis": "2"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat9", 
      "attrs": {
        "axis": "2", 
        "repeats": "25"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "3", 
        "num_args": "2"
      }, 
      "inputs": [[42, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "question", 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims10", 
      "attrs": {"axis": "1"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat10", 
      "attrs": {
        "axis": "1", 
        "repeats": "25"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims11", 
      "attrs": {"axis": "2"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "repeat11", 
      "attrs": {
        "axis": "2", 
        "repeats": "25"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9", 
      "attrs": {
        "dim": "3", 
        "num_args": "2"
      }, 
      "inputs": [[45, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(-1, 63)"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g_fc1_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "g_fc1_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "g_fc1", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g_fc2_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "g_fc2_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "g_fc2", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g_fc3_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "g_fc3_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "g_fc3", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "g_fc4_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "g_fc4_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "g_fc4", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(-1, 625, 256)"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "f_fc1_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "f_fc1_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "f_fc1", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput3", 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    39, 
    46, 
    53, 
    54, 
    57, 
    58, 
    61, 
    62, 
    65, 
    66, 
    71, 
    72, 
    75, 
    76, 
    79, 
    80, 
    83, 
    84, 
    86
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96
  ], 
  "heads": [[87, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10000]}
}